edraprasetio/Traffic-Light/STM32_workspace_9.1/Project 0 Code.zip_expanded/Project0_Code/src/main.c
The malloc failed and stack overflow hook (or callback) functions:
These two hook functions are provided as examples, but do not contain any
functionality.
*/

/* Standard includes. */
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include "stm32f4_discovery.h"
/* Kernel includes. */
#include "stm32f4xx.h"
#include "../FreeRTOS_Source/include/FreeRTOS.h"
#include "../FreeRTOS_Source/include/queue.h"
#include "../FreeRTOS_Source/include/semphr.h"
#include "../FreeRTOS_Source/include/task.h"
#include "../FreeRTOS_Source/include/timers.h"



/*-----------------------------------------------------------*/
#define mainQUEUE_LENGTH 	100
#define ARRAY_SIZE 			19

#define ADC_Port			GPIOC

#define Traffic_Red_Pin  	GPIO_Pin_0
#define Traffic_Yellow_Pin  GPIO_Pin_1
#define Traffic_Green_Pin  	GPIO_Pin_2

#define SHIFT1_REG_Port		GPIOC
#define SHIFT_DATA_PIN		GPIO_Pin_6
#define SHIFT_CLK_PIN		GPIO_Pin_7
#define SHIFT_RESET_PIN		GPIO_Pin_8

//#define SHIFT2_REG_Port		GPIOC
//#define SHIFT2_REG_PIN		GPIO_PIN_6
//#define SHIFT2_CLK_PIN		GPIO_PIN_7
//
//#define SHIFT3_REG_Port		GPIOC
//#define SHIFT3_REG_PIN		GPIO_PIN_6
//#define SHIFT3_CLK_PIN		GPIO_PIN_7
//
//#define SHIFT1_PIN_2	GPIO_PIN_6
//#define SHIFT1_PIN_3	GPIO_PIN_6
//#define SHIFT1_PIN_4	GPIO_PIN_6
//#define SHIFT1_PIN_5	GPIO_PIN_6
//#define SHIFT1_PIN_6	GPIO_PIN_6
//#define SHIFT1_PIN_7	GPIO_PIN_6
//#define SHIFT1_PIN_8	GPIO_PIN_6

#define Prio_Task_Traffic_Flow		( tskIDLE_PRIORITY + 1 )
#define Prio_Task_Traffic_Create	( tskIDLE_PRIORITY + 2 )
#define Prio_Task_Traffic_Light		( tskIDLE_PRIORITY + 2 )
#define Prio_Task_Traffic_Display	( tskIDLE_PRIORITY )


#define LED_CLK_C RCC_AHB1Periph_GPIOC
// Can't use global variables

// Initialize global variables
// Global light color 0: red, 1: green
uint16_t global_flowrate;
uint16_t global_light_color = 1;
uint16_t global_car_value;




//TimerHandle_t			xTimer[3];
//TimerHandle_t			xTimer[3];
//TimerHandle_t			xTimer[3];
TimerHandle_t			Red_Light_TIMER;
TimerHandle_t			Yellow_Light_TIMER;
TimerHandle_t			Green_Light_TIMER;

SemaphoreHandle_t		xMutexFlow;
SemaphoreHandle_t		xMutexTrafficLight;
SemaphoreHandle_t		xMutexCarPosition;


/*
 * TODO: Implement this function for any hardware specific clock configuration
 * that was not already performed before main() was called.
 */
void prvSetupHardware( void );
void ShiftRegisterValuePreLight( uint16_t value );
//static void Traffic_Flow_Task( void *pvParameters);
static void Traffic_Generator_Task( void *pvParameters);
static void Traffic_Light_State_Task( void *pvParameters);
static void System_Display_Task( void *pvParameters);
void Red_Timer_Callback( xTimerHandle xTimer);
void Yellow_Timer_Callback( xTimerHandle xTimer);
void Green_Timer_Callback( xTimerHandle xTimer);
void LIGHT_TIMER_Callback( xTimerHandle xTimer);
static void Manager_Task( void *pvParameters );
void xxx(void);

/*
 * The queue send and receive tasks as described in the comments at the top of
 * this file.
 */
//static void Manager_Task( void *pvParameters );
//static void Blue_LED_Controller_Task( void *pvParameters );
//static void Green_LED_Controller_Task( void *pvParameters );
//static void Red_LED_Controller_Task( void *pvParameters );
//static void Amber_LED_Controller_Task( void *pvParameters );

xQueueHandle xQueue_handle = 0;


/*-----------------------------------------------------------*/

struct TRAFFIC_Struct {
	uint16_t flow;
	int		carArray[ARRAY_SIZE];
	uint16_t car;
	uint16_t light_state;

};

int main(void)
{

	/* Initialize LEDs */
	struct TRAFFIC_Struct TRAFFIC_Init;
//
//	// Start with green traffic light
//	GPIO_SetBits(GPIOC, Traffic_Green_Pin);
//	xTimerStart( Green_Light_TIMER, 0);
//	TRAFFIC_Init->light_state = 1;


	/* Configure the system ready to run the demo.  The clock configuration
	can be done here if it was not done before main() was called. */
	prvSetupHardware();

	xQueue_handle = xQueueCreate( 1, sizeof( TRAFFIC_Init ));
	printf("SIZE of struct: %u \n", sizeof( TRAFFIC_Init ));

	xTaskCreate( Manager_Task, "Manager", configMINIMAL_STACK_SIZE, NULL, 2, NULL);
//	xTaskCreate( Traffic_Flow_Task, "Flow", configMINIMAL_STACK_SIZE, NULL, Prio_Task_Traffic_Flow, NULL);
//	xTaskCreate( Traffic_Generator_Task, "Generator", configMINIMAL_STACK_SIZE, NULL, Prio_Task_Traffic_Create, NULL);
//	xTaskCreate( Traffic_Light_State_Task, "Light-State", configMINIMAL_STACK_SIZE, NULL, Prio_Task_Traffic_Light, NULL);
	xTaskCreate( System_Display_Task, "Display", configMINIMAL_STACK_SIZE, NULL, Prio_Task_Traffic_Display, NULL);

	// Create timers for the traffic light
//	Red_Light_TIMER = xTimerCreate( "Red_Light_Timer", 5000 / portTICK_PERIOD_MS, pdFALSE, ( void * ) 0, Red_Timer_Callback);
//	Yellow_Light_TIMER = xTimerCreate( "Yellow_Light_Timer", 2000 / portTICK_PERIOD_MS, pdFALSE, ( void * ) 0, Yellow_Timer_Callback);
//	Green_Light_TIMER = xTimerCreate( "Green_Light_Timer", 10000 / portTICK_PERIOD_MS, pdFALSE, ( void * ) 0, Green_Timer_Callback);

//	xTimerStart( Green_Light_TIMER, 0);
//	xLightTimer = xTimerCreate( "Traffic_Timer", 2000/portTICK_PERIOD_MS, pdFalse, (void *) 0, LIGHT_TIMER_Callback);

//	TRAFFIC_Init.light_state = 1;
//	TRAFFIC_Init.flow = 4;
//	xQueueSend( xQueue_handle, (void *) &TRAFFIC_Init, 1000);


	vTaskStartScheduler();


	return 0;
}

static void Manager_Task( void *pvParameters ) {

	struct TRAFFIC_Struct Traffic_state;
	Traffic_state.car = 0;

	while(1) {
		if(xQueueSend(xQueue_handle, &Traffic_state, 1000)) {
			printf("MANAGER: Sending data to queue \n");
			vTaskDelay(1000);
		}
		else {
			printf("MANAGER failed! \n");
		}
	}
}

// Traffic Generator Task
/*-----------------------------------------------------------*/
//void Traffic_Generator_Task(void *pvParameters){
////	Generate Traffic
//	printf("Generate Traffic \n");
//	struct TRAFFIC_Struct TRAFFIC_s;
//
//	uint16_t flowrate;
//	uint16_t car_value;
//
//	while(1){
//
//		vTaskDelay(50);
//
////		Retrieve flow value
////		xQueueReceive( xQueue_handle, &(TRAFFIC_r), 500);
////
////		flowrate = TRAFFIC_r->flow;
////		flowrate = 4;
////		printf("GENERATOR_Task: Retrieved flow rate: %u. \n", flowrate);
//
//
//// 		Generate random number based on potentiometer
//		car_value = (rand() % 100);
//		printf("GENERATOR_Task: Updated car value: %u. \n", car_value);
//
////		Set car value to queue and send it back to the queue
//		TRAFFIC_s.car = car_value;
//		if( xQueueSend( xQueue_handle, (void *) &TRAFFIC_s, 1000)) {
//			vTaskDelay(250);
//		} else {
//			printf("GENERATOR_Task failed);
//		}
//
//	}
//}

void System_Display_Task( void *pvParameters){

	struct TRAFFIC_Struct Traffic_state;

	while(1) {

		if(xQueueReceive(xQueue_handle, &Traffic_state, 500)) {

			printf("DISPLAY_TASK: Grabbing value from queue \n");
			Shift_Traffic(Traffic_state.carArray);

