edraprasetio/Traffic-Light/STM32_workspace_9.1/Project 0 Code.zip_expanded/Project0_Code/src/main.c
			Display_Board(Traffic_state);

			if(xQueueSend(xQueue_handle, &Traffic_state, 1000)) {
				vTaskDelay(250);
			} else {
				printf("Display fail \n");
			}
		}
	}
}

void Shift_Traffic( int currentArray[]) {

//	int currentArray[] = traffic.carArray;
	printf("SHIFT: %u \n", currentArray[0]);


//	shift all lights
	for(int i = 18; i > 0; i--) {

//		Red light and check if light 8 is on
		if (i == 8 && global_light_color != 1) {
			// handle not green case
			currentArray[i] = 0;
			continue;
		}

		// if we're behind traffic light
		if( i <= 7) {

			// if light is green just shift normally
			if(global_light_color == 1){
				currentArray[i] = currentArray[i - 1];
			}
			// NOT GREEN
			else {
				// position 7 stops
				if (currentArray[i] == 0){
					currentArray[i] = currentArray[i-1];
				}
			}
		} else {

			currentArray[i] = currentArray[i - 1];
		}
	}
}

void Display_Board( struct TRAFFIC_Struct traffic){

	int cars[19];

	GPIO_ResetBits(GPIOC, SHIFT_RESET_PIN);
	for (int i = 0; i < 10; i++);
	GPIO_SetBits(GPIOC, SHIFT_RESET_PIN);

	for (int val = ARRAY_SIZE - 1; val >= 0; val--) {
//		Write low bits
		if (cars[val] == 0) {
			GPIO_ResetBits(GPIOC, SHIFT_DATA_PIN);
			GPIO_ResetBits(GPIOC, SHIFT_CLK_PIN);
			for (int i = 0; i < 5; i++);
			GPIO_SetBits(GPIOC, SHIFT_CLK_PIN);
		}
		if (cars[val] == 1) {
			GPIO_SetBits(GPIOC, SHIFT_DATA_PIN);
			GPIO_ResetBits(GPIOC, SHIFT_CLK_PIN);
			for (int i = 0; i < 5; i++);
			GPIO_SetBits(GPIOC, SHIFT_CLK_PIN);
			GPIO_ResetBits(GPIOC, SHIFT_DATA_PIN);
		}

	}

}

/*-----------------------------------------------------------*/


// Traffic Light Task
/*-----------------------------------------------------------*/

//void Red_Timer_Callback( xTimerHandle xTimer) {
//	// Red light off, green light on
//	printf("Red light off, green light on\n");
//	GPIO_ResetBits( GPIOC, Traffic_Red_Pin);
//	GPIO_SetBits( GPIOC, Traffic_Green_Pin);
//	struct TRAFFIC_Struct TRAFFIC_State;
//
//	TRAFFIC_State.light_state = 1;
//	xQueueSend( xQueue_handle, (void *) &TRAFFIC_State, 1000);
//
//	// Use semaphore to update global light color to green
////	if( xSemaphoreTake( xMutexTrafficLight, (TickType_t) 0) == pdTRUE ) {
////
//////		global_light_color = 1;
////		xSemaphoreGive( xMutexTrafficLight);
////	}
////	else {
////		printf("Semaphore not available \n");
////	}
//
//	xTimerStart( Green_Light_TIMER, 0);
//
//
//}
//
//void Green_Timer_Callback( xTimerHandle xTimer) {
//	// Green light off, yellow light on
//	printf("Green light off, yellow light on\n");
//	GPIO_ResetBits( GPIOC, Traffic_Green_Pin);
//	GPIO_SetBits( GPIOC, Traffic_Yellow_Pin);
//	struct TRAFFIC_Struct TRAFFIC_State;
//
//	TRAFFIC_State.light_state = 0;
//	xQueueSend( xQueue_handle, (void *) &TRAFFIC_State, 1000);
//
//	//		global_light_color = 0;
////			xSemaphoreGive( xMutexTrafficLight);
//	// Use semaphore to update global light color to red through yellow
////	if( xSemaphoreTake( xMutexTrafficLight, (TickType_t) 0) == pdTRUE ) {
////
////	}
////	else {
////		printf("Semaphore not available \n");
////	}
//
//	xTimerStart( Yellow_Light_TIMER, 0);
//}
//
//void Yellow_Timer_Callback( xTimerHandle xTimer) {
//	printf("Yellow light off, red light on\n");
//	GPIO_ResetBits( GPIOC, Traffic_Yellow_Pin);
//	GPIO_SetBits( GPIOC, Traffic_Red_Pin);
//
//	xTimerStart( Red_Light_TIMER, 0);
//}
//
//void Traffic_Light_State_Task( void *pvParameters) {
//
//	uint16_t current_speed = 4;
//	uint16_t new_speed = 0;;
//
//	while(1) {
//
////		if( xSemaphoreTake( xMutexFlow, (TickType_t) 10) == pdTRUE) {
////			new_speed = global_flowrate;
////		}
////
////		else {
////			printf("Semaphore not available \n");
////		}
//
//		if(xTimerIsTimerActive( Green_Light_TIMER)) {
//			xTimerStop(Green_Light_TIMER, 0);
//			xTimerChangePeriod(Green_Light_TIMER, (5000 + 2000 * (8 - new_speed)) / portTICK_PERIOD_MS, 0);
//			xTimerChangePeriod(Red_Light_TIMER, (2000 + 1500 * (8 - new_speed)) / portTICK_PERIOD_MS, 0);
//			xTimerStop(Red_Light_TIMER, 0);
//		}
//
//		else if(xTimerIsTimerActive( Green_Light_TIMER)) {
//			xTimerChangePeriod(Green_Light_TIMER, (5000 + 2000 * (8 - new_speed)) / portTICK_PERIOD_MS, 0);
//			xTimerStop(Green_Light_TIMER, 0);
//			xTimerChangePeriod(Red_Light_TIMER, (2000 + 1500 * (8 - new_speed)) / portTICK_PERIOD_MS, 0);
//			xTimerStop(Red_Light_TIMER, 0);
//		}
//
//		else if(xTimerIsTimerActive( Green_Light_TIMER)) {
//			xTimerStop(Red_Light_TIMER, 0);
//			xTimerChangePeriod(Green_Light_TIMER, (5000 + 2000 * (8 - new_speed)) / portTICK_PERIOD_MS, 0);
//			xTimerStop(Green_Light_TIMER, 0);
//			xTimerChangePeriod(Red_Light_TIMER, (2000 + 1500 * (8 - new_speed)) / portTICK_PERIOD_MS, 0);
//		}
//
////		if(current_speed != new_speed) {
////		}
//
////		current_speed = new_speed;
//
//	}
//}
//
///*-----------------------------------------------------------*/

// System Display Task
/*-----------------------------------------------------------*/

//void System_Display_Task( void *pvParameters) {
//	uint16_t car_value;
//	struct TRAFFIC_Struct *TRAFFIC_Received;
//	uint16_t light_color = 1;
//
//	uint32_t newlighttraffic[19] = {0};
//	uint32_t currlighttraffic[19] = {0};
//
//	//reset(Clear)
////	GPIO_ResetBits(GPIOC, GPIO_Pin_8);
////	for (int i=0; i<10; i++){
////
////	}
////	GPIO_SetBits(GPIOC, GPIO_Pin_8);
//
//	while(1){
//		vTaskDelay(100);
//
////		If Green light displays
//		if( light_color == 1) {
//			car_value = 1;
//			newlighttraffic[0] = car_value;
//
//			for (uint16_t i = 1; i < 18; i++) {
//				newlighttraffic[i] = currlighttraffic[i - 1];
//			}
//		}
//
////		If Red light displays
//		if( light_color == 0){
//
//			uint16_t emptyQueue = 0;
//			uint16_t lowemptyQueue = 0;
//
//			for(uint16_t i = 18; i>= 1; i--){
//
//				if(currlighttraffic[i] == 0 && emptyQueue == 0){
//					emptyQueue = 1;
//					//newlighttraffic[0] = car_value;//set first light here
//				}
//
////				Cars after traffic light
//				if( i > 7){
//
//					if(emptyQueue == 1) {
//						newlighttraffic[i] = currlighttraffic[i -1];
//					}
//					else {
//						newlighttraffic[i] = currlighttraffic[i];
//					}
//
//				}
//
//
//				else {
//
//					//first 8 lights
//					if( currlighttraffic[i] == 0 && lowemptyQueue == 0) {
//						lowemptyQueue = 1;
//						newlighttraffic[0] = car_value;//set first light here
//					}
//
//					if(lowemptyQueue == 1) {
//						newlighttraffic[i] = currlighttraffic[i -1];
//					}
//					else {
//						newlighttraffic[i] = currlighttraffic[i];
//					}
//
//
//
//				}
//
//			}
//		}
//
//		for (uint16_t i = 18; i >= 0; i--) {
//
//			ShiftRegisterValuePreLight(newlighttraffic[i]);
//
//					for(int i = 0; i>10; i++)
//					{}
//		}
//
//		vTaskDelay(500);
//		if( xQueueReceive(xQueue_handle, &(TRAFFIC_Received), 500)) {
//			car_value = TRAFFIC_Received->car;
////			xSemaphoreGive( xMutexCarPosition);
//			printf("DisplayTask: Accessed xMutexCars, updated local car_value:  %u. \n", car_value );
//		}
////		if(xSemaphoreTake( xMutexCarPosition, ( TickType_t) 10) == pdTRUE) {
////
////
////
////
////		}
////		else {
////			printf("Mutex Car Unavailable \n");
////		}
//
//		if( xQueueReceive(xQueue_handle, &(TRAFFIC_Received), 500)) {
//			light_color = TRAFFIC_Received->light_state;
////			xSemaphoreGive( xMutexTrafficLight);
//			printf("DisplayTask: Accessed:  %u. \n", light_color );
//
//			if( light_color == 1) {
//	//			Green light
//				//ShiftRegisterValuePreLight(car_value);
//				car_value = 1;
//				newlighttraffic[0] = car_value;
//
//				for (uint16_t i = 1; i < 18; i++) {
//					newlighttraffic[i] = currlighttraffic[i - 1];
//				}
//			}
//
//			else if (light_color == 0) {
//	//			Red light
//
//				uint16_t emptyQueue = 0;
//				uint16_t lowemptyQueue = 0;
//
//				for(uint16_t i = 18; i>= 1; i--){
//
//					if(currlighttraffic[i] == 0 && emptyQueue == 0){
//						emptyQueue = 1;
//						//newlighttraffic[0] = car_value;//set first light here
//					}
//
//					if(i>7){
//						if(emptyQueue == 1) {
//							newlighttraffic[i] = currlighttraffic[i -1];
//						}
//						else {
//							newlighttraffic[i] = currlighttraffic[i];
//						}
//
//					}
//
//
//					else{
//
//						//first 8 lights
//						if(currlighttraffic[i] == 0 && lowemptyQueue == 0){
//							lowemptyQueue = 1;
//							newlighttraffic[0] = car_value;//set first light here
//						}
//
//						if(lowemptyQueue == 1) {
//							newlighttraffic[i] = currlighttraffic[i -1];
//						}
//						else {
//							newlighttraffic[i] = currlighttraffic[i];
//						}
//
//
//
//					}
//
//				}
//
//			}
//
//
//			for (uint16_t i = 18; i >= 0; i--) {
//
//				ShiftRegisterValuePreLight(newlighttraffic[i]);
//
//						for(int i = 0; i>10; i++)
//						{}
//			}
//		}
//
////		if(xSemaphoreTake( xMutexTrafficLight, ( TickType_t) 0) == pdTRUE) {
////
////
////
////		}
////		else {
////			printf("Mutex Light Unavailable \n");
////		}
//
//
//
////		for (uint32_t i = 0; i < 8; i++) {
////			currlighttraffic[i] = newlighttraffic[i];
////		}
//
//	}
//
//}


/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
	/* The malloc failed hook is enabled by setting
	configUSE_MALLOC_FAILED_HOOK to 1 in FreeRTOSConfig.h.

