edraprasetio/Traffic-Light/STM32_workspace_9.1/Project 0 Code.zip_expanded/Project0_Code/src/main.c
	Called if a call to pvPortMalloc() fails because there is insufficient
	free memory available in the FreeRTOS heap.  pvPortMalloc() is called
	internally by FreeRTOS API functions that create tasks, queues, software 
	timers, and semaphores.  The size of the FreeRTOS heap is set by the
	configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h. */
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( xTaskHandle pxTask, signed char *pcTaskName )
{
	( void ) pcTaskName;
	( void ) pxTask;

	/* Run time stack overflow checking is performed if
	configconfigCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
	function is called if a stack overflow is detected.  pxCurrentTCB can be
	inspected in the debugger if the task name passed into this function is
	corrupt. */
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{
volatile size_t xFreeStackSpace;

	/* The idle task hook is enabled by setting configUSE_IDLE_HOOK to 1 in
	FreeRTOSConfig.h.

	This function is called on each cycle of the idle task.  In this case it
	does nothing useful, other than report the amount of FreeRTOS heap that
	remains unallocated. */
	xFreeStackSpace = xPortGetFreeHeapSize();

	if( xFreeStackSpace > 100 )
	{
		/* By now, the kernel has allocated everything it is going to, so
		if there is a lot of heap remaining unallocated then
		the value of configTOTAL_HEAP_SIZE in FreeRTOSConfig.h can be
		reduced accordingly. */
	}
}
/*-----------------------------------------------------------*/

void prvSetupHardware(void)
{
	/* Ensure all priority bits are assigned as preemption priority bits.
	http://www.freertos.org/RTOS-Cortex-M3-M4.html */
	NVIC_SetPriorityGrouping( 0 );

	GPIO_InitTypeDef  	GPIO_Init_Shift_1;
	GPIO_InitTypeDef	GPIO_Init_Traffic;
	//GPIO_InitTypeDef  GPIO_Init_Shift_2;
	//GPIO_InitTypeDef  GPIO_Init_Shift_3;
	//GPIO_InitTypeDef  GPIO_Init_Traffic;

	/* Enable the GPIO_LED Clock */
	RCC_AHB1PeriphClockCmd(LED_CLK_C, ENABLE);
	//RCC_AHB1PeriphClockCmd(LED_CLK_A, ENABLE);

	GPIO_Init_Shift_1.GPIO_Pin = SHIFT_DATA_PIN | SHIFT_CLK_PIN | GPIO_Pin_8 ;
	GPIO_Init_Shift_1.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_Init_Shift_1.GPIO_OType = GPIO_OType_PP;
	GPIO_Init_Shift_1.GPIO_PuPd = GPIO_PuPd_NOPULL;
	//GPIO_Init_Shift_1.GPIO_Speed = GPIO_Speed_25MHz;
	//GPIO_Init(SHIFT1_REG_Port, &GPIO_Init_Shift_1);

	GPIO_Init_Traffic.GPIO_Pin = Traffic_Green_Pin | Traffic_Red_Pin | Traffic_Yellow_Pin;
	GPIO_Init_Traffic.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_Init_Traffic.GPIO_OType = GPIO_OType_PP;
	GPIO_Init_Traffic.GPIO_PuPd = GPIO_PuPd_NOPULL;
	//GPIO_Init_Shift_1.GPIO_Speed = GPIO_Speed_25MHz;
	GPIO_Init(SHIFT1_REG_Port, &GPIO_Init_Traffic);



//	GPIO_Init_Shift_2.GPIO_Pin = SHIFT2_REG_PIN | SHIFT2_CLK_PIN;
//	GPIO_Init_Shift_2.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_Init_Shift_2.GPIO_OType = GPIO_OType_PP;
//	GPIO_Init_Shift_2.GPIO_PuPd = GPIO_PuPd_NOPULL;
//	//GPIO_Init_Shift_2.GPIO_Speed = GPIO_Speed_25MHz;
//	GPIO_Init(SHIFT2_REG_Port, &GPIO_Init_Shift_2);
//


	/* TODO: Setup the clocks, etc. here, if they were not configured before
	main() was called. */
}

//void ShiftRegisterValuePreLight(uint16_t value) //uint16_t
//{
//	if (value == 0){
//		GPIO_ResetBits(GPIOC, SHIFT1_REG_PIN);
//
//	}else{
//		GPIO_SetBits(GPIOC, SHIFT1_REG_PIN);
//	}
//	GPIO_SetBits(GPIOC, SHIFT1_CLK_PIN);
//	GPIO_ResetBits(GPIOC, SHIFT1_CLK_PIN);
//}

void xxx(void){
//uint16_t newactiveprelighttraffic[8] = {0};
//	while (1)
//	{
//
//	//reset(Clear)
//	GPIO_ResetBits(GPIOC, GPIO_Pin_8);
//	for (int i=0; i<10; i++){
//
//	}
//	GPIO_SetBits(GPIOC, GPIO_Pin_8);
//
//	uint32_t newactiveprelighttrafficoff[24] = {0};
//	uint16_t car_value = 0;
//
//	for (uint16_t i=0; i<24; i++){
//		newactiveprelighttrafficoff[i] = car_value;
//	}
//
//	for (uint16_t i=23; i>0; i--){
//		ShiftRegisterValuePreLight(newactiveprelighttrafficoff[i]);
//
//		for(int i = 0; i>10; i++)
//		{}
//	}
//
//	uint32_t newactiveprelighttraffic[24] = {0};
//	car_value = 1;
//
//	for (uint16_t i=0; i<24; i++){
//		newactiveprelighttraffic[i] = car_value;
//	}
//
//	for (uint16_t i=23; i>0; i--){
//		ShiftRegisterValuePreLight(newactiveprelighttraffic[i]);
//
//		for(int i = 0; i>10; i++)
//		{}
//	}
//
//
//
//
//	}
}
